# 0.Вывести квадрат числа

number = int(input('Введите число>> '))
print(f'Квадрат числа {number} равен {number**2}')