# 5.Написать программу вычисления значения функции y = f(a)

def f(a):
    y = a**2 + 2*a
    return y

arg = 14
print(f(arg))